bimestre1/trabalho-codeigniter4/app/Controllers/Home.php

SELECT *
FROM `nerds`
WHERE `email` = 'admin'
---
        public function login() {
            $nerdsModel = new NerdsModel();
            $email = $this->request->getVar('email');
            $password = $this->request->getVar('password');

            if(!$this->verifyEmail($email)) {
                $this->session->setFlashdata('error', 'O endereço de e-mail não confere!');
                return redirect()->to('signin');
            }

            if(!$this->verifyPassword($password, $email)) {
                $this->session->setFlashdata('error', 'A senha não confere!');
                return redirect()->to('signin');
            }

            $user = $nerdsModel->getWhere(['email'=>$email])->getRowArray();

SELECT *
FROM `nerds`
WHERE `email` = 'admin'
---
        public function verifyEmail($email) {
            $nerdsModel = new NerdsModel();
            $email = $nerdsModel->getWhere(['email' => $email])->getRowArray();

SELECT *
FROM `nerds`
WHERE `email` = 'admin'
---
        public function verifyPassword($password, $email) {
            $nerdsModel = new NerdsModel();
            $token = $nerdsModel->getWhere(['email'=>$email])->getRowArray()['password'];

SELECT *
FROM `livros`
---
    public function books() {
        $booksModel = new LivrosModel();
        $booksArray = $booksModel->findAll();

SELECT *
FROM `livros`
WHERE `available` > 0
AND  `title` LIKE '%%' ESCAPE '!'
ORDER BY `year` DESC
---
        public function search() {
            $query = $this->request->getVar('pesquisa');
            $booksModel = new LivrosModel();

            if ($query == '') {
                header("Refresh: 0");
            }
            else {
                if (is_numeric($query)) {
                    $_SESSION['livros'] = $booksModel -> where('available >', 0)->where('year', $query)->find();
                }
                else {
                    $_SESSION['livros'] = $booksModel -> where('available >', 0)->like('title', $query)->find();