bimestre1/exercicio2-codeigniter4/app/Controllers/FirstAm.php

SELECT *
FROM `artistas`
---
    public function index()
    {
        $artistasModel = new ArtistasModel();

        $result = $artistasModel->findAll();

INSERT INTO `artistas` (`nome`, `bio`, `gen`, `pais`) VALUES ('lupe de lupe', 'sao mineiro', 'noise rock', 'minas gerais')
---
    public function update()
    {
        $artistasModel = new ArtistasModel();
        $id = $this->request->getVar('id');
        $typeaction = $this->request->getVar('typeaction');
        $data = array(
            'nome' => $this->request->getVar('nome'),
            'bio' => $this->request->getVar('bio'),
            'gen' => $this->request->getVar('gen'),
            'pais' => $this->request->getVar('pais')
        );
        ($typeaction == 'insert')?$artistasModel->insert($data):$artistasModel->update($id, $data);

SELECT *
FROM `artistas`
WHERE `artistas`.`id` = '1'
---
    public function getDataItem($id)
    {
        $artistasModel = new ArtistasModel();
        $result = $artistasModel->find($id);