bimestre1/exercicio2-codeigniter4/app/Controllers/Home.php

SELECT *
FROM `artistas`
---
    public function index()
    {
        $artistasModel = new ArtistasModel();

        $result = $artistasModel->findAll();

INSERT INTO `artistas` (`nome`, `bio`, `gen`, `pais`) VALUES ('nome', 'bio', 'gen', 'pais')
---
    public function update()
    {
        $artistasModel = new ArtistasModel();

        $data = array(
            'nome' => $this->request->getVar('nome'),
            'bio' => $this->request->getVar('bio'),
            'gen' => $this->request->getVar('gen'),
            'pais' => $this->request->getVar('pais')
        );

        $artistasModel->insert($data);